app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by email: params[:password_reset][:email].downcase
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "linh@gmail.com"], ["LIMIT", 1]]

  def update
    if params[:user][:password].blank?
      @user.errors.add :password, t(".empty_password_error")
      render :edit
    elsif @user.update user_params
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$AtD8Vv2hQIDyggnILbalI.9QxFgT5Se/Wu3svxQM7qpbk0wN.LyR2"], ["updated_at", "2019-10-31 01:56:58.271336"], ["id", 101]]

  def load_user
    return if @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "phamlinh0898@gmail.com"], ["LIMIT", 1]]