app/controllers/sessions_controller.rb

  def create
    sessions = params[:session]
    user = User.find_by email: sessions[:email].downcase
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "linh@gmail.com"], ["LIMIT", 1]]