app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).per Settings.n15
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new user_params
    if @user.save
      @user.send_activation_email
      flash[:info] = t "users.create.please"
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    if @user.update user_params
      flash[:success] = t "users.update.profile"
      redirect_to @user
    else
      flash[:danger] = t "users.update.error"
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$4k0JPh44gSd05lEmhYoa1.THXp2e7nxLD5VOoLT316Pd5hfzH8nQK"], ["updated_at", "2019-10-18 04:43:30.689531"], ["id", 7]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$HGPCRICxTWr/nptbOskwF.H8I9OajSU4UDdwqhc5LeyZFpsdOGxIC"], ["updated_at", "2019-10-21 01:40:27.970623"], ["id", 8]]

  def destroy
    if @user.destroy
      flash[:success] = t "users.destroy.delete"
    else
      flash[:danger] = t "users.destroy.delete_error"
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 26]]

  def load_user
    @user = User.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]